app/Controllers/AdminController.php

    public function inputMahasiswaView()
    {
        $studentsModel = new StudentsModel();
        $students = $studentsModel->findAll();
---
SELECT *
FROM `students`

    public function simpanMahasiswa()
    {
        $studentsModel = new StudentsModel();

        $data = [
            'id' => $this->request->getPost('id'),
            'nama' => $this->request->getPost('nama'),
            'nim' => $this->request->getPost('nim'),
            'semester' => $this->request->getPost('semester'),
        ];

        $studentsModel->insert($data);
---
INSERT INTO `students` (`id`, `nama`, `nim`, `semester`) VALUES ('115', 'monikah', '115', '4')

    public function inputDosenView()
    {
        $teachersModel = new TeachersModel();
        $teachers = $teachersModel->findAll();
---
SELECT *
FROM `teacher`

    public function inputNilai()
    {
        $studentsModel = new StudentsModel();

        // Ambil semua data mahasiswa
        $students = $studentsModel->findAll();
---
SELECT *
FROM `students`