app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'kaylaa'
 LIMIT 1
---
    public function login()
    {
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Ambil user berdasarkan username
        $user = $model->where('username', $username)->first();

INSERT INTO `users` (`id`, `username`, `password`, `role`) VALUES ('115', 'monikah', '$2y$10$VnFm1gtx/WUFHOAH5QNUqOHarWbbKeVPMU4Dvdnq9QYiqaZ5H0DBW', 'student')
---
    public function signup()
    {
        $model = new UserModel();

        $data = [
            'id' => $this->request->getPost('id'),
            'username' => $this->request->getPost('username'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT),
            'role' => $this->request->getPost('role')
        ];

        // Simpan user baru
        if ($model->save($data)) {